Revit 2027 API
DuctLossMethodType Enumeration
An enumerated type listing all duct loss calculation methods for a connector.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DuctLossMethodType
Public Enumeration DuctLossMethodType
public enum class DuctLossMethodType
type DuctLossMethodType
Members
Member name | Value | Description
Coefficient | 6 | Duct loss method depends on the loss coefficient.
NotDefined | 0 | Duct loss method is undefined.
SpecificLoss | 4 | Duct loss method is specified.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace